Ce1estia1/GKC4D/MK66F18_Ref9a(2).c
/*
 * Copyright 2016-2023 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of NXP Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
//sjy
/**
 * @file    MK66F18_Ref2a.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include <string.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "MK66F18.h"
#include "fsl_debug_console.h"
#include "fsl_i2c.h"
#include "fsl_uart.h"
#include "fsl_rtc.h"
#include "CDK66_OLED.h"
#include "pin_mux.h"
// sunjinyi
/* TODO: insert other include files here. */

/* TODO: insert other definitions and declarations here. */
#define SW1() 			GPIO_PinRead(BOARD_INITPINS_SW1_GPIO, BOARD_INITPINS_SW1_PIN)
#define SW2() 			GPIO_PinRead(BOARD_INITPINS_SW2_GPIO, BOARD_INITPINS_SW2_PIN)
#define SW3() 			GPIO_PinRead(BOARD_INITPINS_SW3_GPIO, BOARD_INITPINS_SW3_PIN)
#define SW4() 			GPIO_PinRead(BOARD_INITPINS_SW4_GPIO, BOARD_INITPINS_SW4_PIN)
#define KEY1() 			!GPIO_PinRead(BOARD_INITPINS_KEY1_GPIO, BOARD_INITPINS_KEY1_PIN)
#define KEY2() 			!GPIO_PinRead(BOARD_INITPINS_KEY2_GPIO, BOARD_INITPINS_KEY2_PIN)
#define QESA() 			GPIO_PinRead(BOARD_INITPINS_QEPA_GPIO, BOARD_INITPINS_QEPA_PIN)
#define QESB() 			GPIO_PinRead(BOARD_INITPINS_QEPB_GPIO, BOARD_INITPINS_QEPB_PIN)
#define BTN() 			!GPIO_PinRead(BOARD_INITPINS_BTN_GPIO, BOARD_INITPINS_BTN_PIN)

#define LED1_ON() 		GPIO_PortClear(BOARD_INITPINS_LED1_GPIO, BOARD_INITPINS_LED1_GPIO_PIN_MASK)
#define LED1_OFF() 		GPIO_PortSet(BOARD_INITPINS_LED1_GPIO, BOARD_INITPINS_LED1_GPIO_PIN_MASK)
#define LED1_TOGGLE() 	GPIO_PortToggle(BOARD_INITPINS_LED1_GPIO, BOARD_INITPINS_LED1_GPIO_PIN_MASK)
#define LED2_ON() 		GPIO_PortClear(BOARD_INITPINS_LED2_GPIO, BOARD_INITPINS_LED2_GPIO_PIN_MASK)
#define LED2_OFF() 		GPIO_PortSet(BOARD_INITPINS_LED2_GPIO, BOARD_INITPINS_LED2_GPIO_PIN_MASK)
#define LED2_TOGGLE() 	GPIO_PortToggle(BOARD_INITPINS_LED2_GPIO, BOARD_INITPINS_LED2_GPIO_PIN_MASK)
#define BEEP_ON() 		GPIO_PortSet(BOARD_INITPINS_BEEP_GPIO, BOARD_INITPINS_BEEP_GPIO_PIN_MASK)
#define BEEP_OFF() 		GPIO_PortClear(BOARD_INITPINS_BEEP_GPIO, BOARD_INITPINS_BEEP_GPIO_PIN_MASK)
#define BEEP_TOGGLE() 	GPIO_PortToggle(BOARD_INITPINS_BEEP_GPIO, BOARD_INITPINS_BEEP_GPIO_PIN_MASK)
#define M1_ENABLE() 	GPIO_PortSet(BOARD_INITPINS_MLEN_GPIO, BOARD_INITPINS_MLEN_GPIO_PIN_MASK)
#define M1_DISABLE() 	GPIO_PortClear(BOARD_INITPINS_MLEN_GPIO, BOARD_INITPINS_MLEN_GPIO_PIN_MASK)
#define M2_ENABLE() 	GPIO_PortSet(BOARD_INITPINS_MREN_GPIO, BOARD_INITPINS_MREN_GPIO_PIN_MASK)
#define M2_DISABLE() 	GPIO_PortClear(BOARD_INITPINS_MREN_GPIO, BOARD_INITPINS_MREN_GPIO_PIN_MASK)

#define CCD_SI_HIGH		GPIO_PinWrite(BOARD_INITPINS_CCDSI_GPIO, BOARD_INITPINS_CCDSI_PIN, 1)
#define CCD_SI_LOW		GPIO_PinWrite(BOARD_INITPINS_CCDSI_GPIO, BOARD_INITPINS_CCDSI_PIN, 0)
#define CCD_CLK_HIGH	GPIO_PinWrite(BOARD_INITPINS_CCDCLK_GPIO, BOARD_INITPINS_CCDCLK_PIN, 1)
#define CCD_CLK_LOW		GPIO_PinWrite(BOARD_INITPINS_CCDCLK_GPIO, BOARD_INITPINS_CCDCLK_PIN, 0)

#define I2C_CAT9555_BASEADDR I2C3
#define I2C_CAT9555_SLAVE_ADDR_7BIT 0x22U
#define I2C_CAT9555_DATA_LENGTH 2U
#define USB_RING_BUFFER_SIZE	(128U)
#define cmdDataLenMax			(100U)

typedef struct _Board_Analog
{
	 uint32_t	x;			// MMA7260 x
	 uint32_t	y;			// MMA7260 y
	 uint32_t	z;			// MMA7260 z
	 uint32_t	IRV1;		// IR sensor #1
	 uint32_t	IRV2;		// IR sensor #2
	 uint32_t	HALL1;		// Hall sensor #1
	 uint32_t	HALL2;		// Hall sensor #2
	 uint32_t	VSENSE;		// Battery Voltage
	 uint32_t	Temp;		// On-chip temperature sensor
	 uint32_t	CCD;		// TSL1401 Linear CCD
} Board_Analog_t;

// Variables for HMI
static uint8_t DSPTable[] = { 0x40, 0x79, 0x24, 0x30, 0x19, 0x12, 0x02, 0x78, 0x00, 0x10, 0x08, 0x03, 0x27, 0x21, 0x06, 0x0E };
uint16_t QESVar=0;

// Variables for I2C3
uint8_t g_master_txBuff[I2C_CAT9555_DATA_LENGTH];
uint8_t g_master_rxBuff[I2C_CAT9555_DATA_LENGTH];
i2c_master_transfer_t masterXfer;

// Variable for RTC
rtc_datetime_t appDateTime;
uint32_t ElapsedSeconds = 0;

// Variables for ADCs
Board_Analog_t AnalogIn;

// Variables for UART
bool CmdDataReady;		// new cmd data flag, 1: new cmd received
uint8_t CmdDataLen;		// PC cmd data length counter
uint8_t CmdDataBuffer[cmdDataLenMax];	// buffer to hold cmd data from PC
uint8_t UsbRingBuffer[USB_RING_BUFFER_SIZE];
uint16_t g_bufferWriteByteCnt;
volatile uint16_t txIndexUSB=0;		// Index of the debug port data to send out.
volatile uint16_t rxIndexUSB=0;		// Index of the memory to save new arrived debug port data.

// Variables for MMA7260
uint16_t MemsX, MemsY, MemsZ;
float MemsX1, MemsY1, MemsZ1, VBat;

// Variables for Servo & Motors
bool servo_update_flag = true;
uint16_t ServoDC1, ServoDC2;
uint16_t ServoDC1ref = 1500;
uint16_t ServoDC2ref = 1500;
uint16_t ServoLimitUpper = 1950;	// Adjust for a better value on your car
uint16_t ServoLimitLower = 1050;	// Adjust for a better value on your car
uint8_t MotorSpeedCmd1=0, MotorSpeedCmd2=0;
uint16_t MotorSpeedCal=0;			// debug purpose
uint32_t MotorSpeedFdbk1=0, MotorSpeedFdbk2=0;
bool MotorDir1, MotorDir2;

// Variables for Linear CCD TSL1401
uint16_t JumpCounter = 0;
uint16_t LoopCounter = 0;
uint16_t barcounter = 0;
uint16_t start = 0;
uint16_t end = 128;
uint16_t CCDData[128];	// Linear CCD raw data
uint16_t TrackIndex;	// Target tracking point index from 1 to 128
uint32_t pointrow[108]={0};
// Variables for MT9V034
uint8_t Image_Data[120][188];	// MT9V034 DMA data receiver ROW*COL: 120*188
uint8_t Image_Use[60][94];	// resized CAM data to fit OLED
uint8_t Pixle[60][94];		// 0/1 CAM data
uint16_t CAM_DMA_Counter=0;
uint8_t CamLineCounter=0;
bool CamDataReady=0;	// MT9V034 new data frame ready in buffer

void DMA_CAM_Repeat(uint8_t LineNumber)
{
	DMA_DMA_BASEADDR->TCD[DMA_CH0_DMA_CHANNEL].DADDR         = (uint32_t) &Image_Data[LineNumber][0];
	DMA_DMA_BASEADDR->TCD[DMA_CH0_DMA_CHANNEL].CITER_ELINKNO = DMA_CITER_ELINKNO_CITER(188);
	DMA_DMA_BASEADDR->TCD[DMA_CH0_DMA_CHANNEL].BITER_ELINKNO = DMA_BITER_ELINKNO_BITER(188);
	//EDMA_EnableChannelRequest(DMA_DMA_BASEADDR, DMA_CH0_DMA_CHANNEL);
	DMA_DMA_BASEADDR->SERQ = DMA_SERQ_SERQ(DMA_CH0_DMA_CHANNEL);
}

/* DMA0_DMA16_IRQn interrupt handler */
void DMA_DMA_CH_INT_DONE_0_IRQHANDLER(void) {
  uint32_t CH0_status;

  /* Reading all flags of status register */
  CH0_status = EDMA_GetChannelStatusFlags(DMA_DMA_BASEADDR, DMA_CH0_DMA_CHANNEL);
  /* Clearing all flags of the channel status register */
  EDMA_ClearChannelStatusFlags(DMA_DMA_BASEADDR, DMA_CH0_DMA_CHANNEL, CH0_status);

  /* Place your code here */
  //CamDataReady = 1;
  //DMA_CAM_Repeat();

